snlkuharlocal/src/InformationRegisters/ИнформацияШКЛП/ИнформацияШКЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияШКЛП</name>
  <attributes>
    <name>НомерЛП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробкиЛП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ШКЛистаПереукладки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ИнформацияШКЛП/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	//крохин начало 25.12.2013
	//проверка на корректность, при ошибке пишем в лог

		Для Каждого Запись Из ЭтотОбъект Цикл
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформацияШКЛП.ШК,
	               |	ИнформацияШКЛП.ШКЛистаПереукладки,
	               |	ИнформацияШКЛП.НомерЛП
	               |ИЗ
	               |	РегистрСведений.ИнформацияШКЛП КАК ИнформацияШКЛП
	               |ГДЕ
	               |	ИнформацияШКЛП.ШК = &ШК
	               |	И ИнформацияШКЛП.ШКЛистаПереукладки <> &ШКЛистаПереукладки";
				   Запрос.УстановитьПараметр("ШК",Запись.ШК);
				   Запрос.УстановитьПараметр("ШКЛистаПереукладки",Запись.ШКЛистаПереукладки);
				    выборка = запрос.Выполнить().Выбрать();
					Если выборка.Следующий() Тогда
						ЗаписатьВЛог("дубль ШК ЛП","ШК: "+выборка.ШК + " .ЛП существующий: "+выборка.НомерЛП+" . ШКЛП: "+выборка.ШКЛистаПереукладки+" ЛП новый: "+Запись.НомерЛП+" ШК ЛП: "+запись.ШКЛистаПереукладки  ,"Информация") ;
					КонецЕсли;
           КонецЦикла;
	//крохин конец 25.12.2013

 //Кухарь 12.01.16 начало
 //Не грузим больше
	//Если ОбменДанными.Загрузка И ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//	НадоВыгружать = Ложь;
	//Иначе
	//	НадоВыгружать = Истина;
	//КонецЕсли;
	//Если НадоВыгружать Тогда
	//	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	//КонецЕсли;
//Кухарь 12.01.16 конец
КонецПроцедуры
